{
  "id": "2508.03560",
  "title": "LaTCoder: Converting Webpage Design to Code with Layout-as-Thought",
  "authors": [
    {
      "_id": "6892be3d8da45ffb0a2b240f",
      "user": {
        "_id": "6523ad818fc4884992051c8f",
        "avatarUrl": "/avatars/fe19eb397e7c121f78b370b456e542cf.svg",
        "isPro": false,
        "fullname": "Yi Gui",
        "user": "starmage520",
        "type": "user"
      },
      "name": "Yi Gui",
      "status": "claimed_verified",
      "statusLastChangedAt": "2025-08-06T19:17:22.322Z",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2410",
      "name": "Zhen Li",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2411",
      "name": "Zhongyi Zhang",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2412",
      "name": "Guohao Wang",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2413",
      "name": "Tianpeng Lv",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2414",
      "name": "Gaoyang Jiang",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2415",
      "name": "Yi Liu",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2416",
      "name": "Dongping Chen",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2417",
      "name": "Yao Wan",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2418",
      "name": "Hongyu Zhang",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b2419",
      "name": "Wenbin Jiang",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b241a",
      "name": "Xuanhua Shi",
      "hidden": false
    },
    {
      "_id": "6892be3d8da45ffb0a2b241b",
      "name": "Hai Jin",
      "hidden": false
    }
  ],
  "abstract": "Converting webpage designs into code (design-to-code) plays a vital role in\nUser Interface (UI) development for front-end developers, bridging the gap\nbetween visual design and functional implementation. While recent Multimodal\nLarge Language Models (MLLMs) have shown significant potential in\ndesign-to-code tasks, they often fail to accurately preserve the layout during\ncode generation. To this end, we draw inspiration from the Chain-of-Thought\n(CoT) reasoning in human cognition and propose LaTCoder, a novel approach that\nenhances layout preservation in webpage design during code generation with\nLayout-as-Thought (LaT). Specifically, we first introduce a simple yet\nefficient algorithm to divide the webpage design into image blocks. Next, we\nprompt MLLMs using a CoTbased approach to generate code for each block.\nFinally, we apply two assembly strategies-absolute positioning and an\nMLLM-based method-followed by dynamic selection to determine the optimal\noutput. We evaluate the effectiveness of LaTCoder using multiple backbone MLLMs\n(i.e., DeepSeek-VL2, Gemini, and GPT-4o) on both a public benchmark and a newly\nintroduced, more challenging benchmark (CC-HARD) that features complex layouts.\nThe experimental results on automatic metrics demonstrate significant\nimprovements. Specifically, TreeBLEU scores increased by 66.67% and MAE\ndecreased by 38% when using DeepSeek-VL2, compared to direct prompting.\nMoreover, the human preference evaluation results indicate that annotators\nfavor the webpages generated by LaTCoder in over 60% of cases, providing strong\nevidence of the effectiveness of our method.",
  "url": "https://huggingface.co/papers/2508.03560",
  "pdf_url": "https://arxiv.org/pdf/2508.03560.pdf"
}